W7D3/goal_app/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Glen1"], ["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
      return nil unless user = User.find_by(email: email)