W6D5/ninety_nine_cats/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @cat = Cat.new(cat_params)
        if @cat.save