W8D1/reddit_clone_project/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = ?  [["sub_id", 1]]
---
<h1><%= @sub.title %></h1>
<% @sub.posts.each do |post| %>