W8D1/reddit_clone_project/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.moderator = current_user
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Cats"], ["description", "meow"], ["moderator", 2], ["created_at", "2020-03-30 23:37:48.971701"], ["updated_at", "2020-03-30 23:37:48.971701"]]