W6D3/artshare_api_p1/app/controllers/users_controller.rb

    def create
      user = User.new(userParam)
      #debugger
      if user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "'mike222@aa.io'"], ["created_at", "2020-03-19 22:11:56.668061"], ["updated_at", "2020-03-19 22:11:56.668061"]]

    def update
      user = User.find(params[:id])
      if user.update(userParam)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "'glenn'"], ["email", "'glenn@gmail.com'"], ["updated_at", "2020-03-19 22:25:41.721105"], ["id", 1]]