W8D1/reddit_clone_project/app/views/users/show.html.erb

  <label>Subs
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"